In [4]:
import numpy as np
import pandas as pd

In [5]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]
          }

In [6]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [7]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [8]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,100,50,300]
          }

In [9]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [10]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"], 
           "Spor" : ["Koşu", "Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }

In [11]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [12]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [13]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# Concatenation

In [14]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# Merge

In [33]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Muhammet", "Yusuf"],
               "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"]
               }

In [34]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [35]:
mergeDataFrame1

       Isim       Spor
0     Ahmet       Koşu
1    Mehmet      Yüzme
2  Muhammet       Koşu
3     Yusuf  Basketbol

In [36]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet", "Muhammet", "Yusuf"],
               "Kalori" : [100,150,250,200]
               }

In [37]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [38]:
mergeDataFrame2

       Isim  Kalori
0     Ahmet     100
1    Mehmet     150
2  Muhammet     250
3     Yusuf     200

In [39]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Isim")

       Isim       Spor  Kalori
0     Ahmet       Koşu     100
1    Mehmet      Yüzme     150
2  Muhammet       Koşu     250
3     Yusuf  Basketbol     200

In [40]:
#Ortak olmayan isim varsa o satır drop olur

# İleri Operasyonlar

In [42]:
maasSozluk = {"Isim" : ["Ahmet", "Mehmet", "Muhammet", "Yusuf"],
              "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
               "Maas" : [200,300,400,500]
               }

In [43]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [44]:
maasDataFrame

       Isim  Departman  Maas
0     Ahmet    Yazılım   200
1    Mehmet      Satış   300
2  Muhammet  Pazarlama   400
3     Yusuf    Yazılım   500

In [46]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [47]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [49]:
maasDataFrame["Departman"].nunique()
#Number of Unique

3

In [50]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [57]:
def bruttenNete (maas):
    return maas * 0.66

In [58]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [59]:
bruttenNete(maasDataFrame["Maas"])

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [60]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False